clase32/02-artilleryYML/artillery/testFork.yml
config:
  target: 'http://localhost:8081'
  phases:
    - duration: 5
      arrivalRate: 50
      name: Warm up
  payload:
    path: 'keys.csv'
    fields:
      - 'id'
scenarios:
  - name: 'Search all Materials & then find a specific material'
    flow:
      - get:
          url: '/api/materials'
      - think: 10
      - get:
          url: '/api/materials?id={{id}}'